In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2['d']

4

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [13]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon':16000, 'Utah': 5000}

In [19]:
obj3 = pd.Series(sdata)

In [20]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)

In [22]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [29]:
obj4.name = 'population'

In [30]:
obj4.index.name = 'state'

In [31]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [33]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [35]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [36]:
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [37]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [38]:
frame2 = pd.DataFrame(data, columns = ['year','state','pop','debt'],
                     index = ['one','two','three','four','five','six'])

In [39]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [40]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [42]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [43]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
frame2['debt'] = 16.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [46]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [47]:
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [48]:
frame2['debt'] = val

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [50]:
frame2['eastern'] = frame2.state == 'Ohio'

In [51]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [52]:
del frame2['eastern']

In [53]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [54]:
pop={'Nevada':{2001:2.4,2002:2.9},
    'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [55]:
frame3=pd.DataFrame(pop)

In [56]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [57]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [58]:
pd.DataFrame(pop, index=pd.Series([2001, 2002, 2003]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [59]:
pdata = {'Ohio': frame3['Ohio'][:-1],
'Nevada': frame3['Nevada'][:2]}

In [60]:
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [61]:
 frame3.index.name = 'year'; frame3.columns.name = 'state'

In [62]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [63]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [64]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [65]:
obj=pd.Series(range(3),index=['a','b','c'])

In [66]:
index=obj.index

In [67]:
index

Index(['a', 'b', 'c'], dtype='object')

In [68]:
index[1:]

Index(['b', 'c'], dtype='object')

In [69]:
labels=pd.Index(np.arange(3))

In [70]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [71]:
obj2=pd.Series([1.5,-2.5,0], index=labels)

In [72]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [73]:
obj2.index is labels

True

In [74]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [75]:
frame.columns

Index(['pop', 'state', 'year'], dtype='object')

In [76]:
'Ohio' in frame3.columns

True

In [77]:
2003 in frame3.index

False

In [78]:
dup_labels=pd.Index(['foo','foo','bar','bar'])

In [79]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [80]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [81]:
 obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [82]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [83]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [84]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [85]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [86]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],
columns=['Ohio', 'Texas', 'California'])

In [87]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [88]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [89]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [90]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [91]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [92]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [93]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [94]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [95]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [96]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [99]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [100]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [101]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [102]:
obj['b']

1.0

In [103]:
obj[1]

1.0

In [104]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [105]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [106]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [107]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [108]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [109]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [110]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [111]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [113]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [114]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [115]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [116]:
data <5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [117]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [119]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [120]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [121]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [122]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [123]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [124]:
ser = pd.Series(np.arange(3.))

In [125]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [126]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [127]:
 ser2[-1]

2.0

In [128]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [129]:
ser.iloc[:1]

0    0.0
dtype: float64

In [130]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [131]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [132]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [133]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [134]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [135]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])

In [136]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [137]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [138]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [139]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [140]:
df1 = pd.DataFrame({'A': [1, 2]})

In [141]:
df2 = pd.DataFrame({'B': [3, 4]})

In [142]:
df1

   A
0  1
1  2

In [143]:
df2

   B
0  3
1  4

In [144]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [146]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))

In [147]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

In [148]:
df2.loc[1, 'b'] = np.nan

In [149]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [150]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [151]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [152]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [153]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [154]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [155]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [156]:
arr = np.arange(12.).reshape((3, 4))

In [157]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [158]:
arr[0]

array([0., 1., 2., 3.])

In [159]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [160]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [161]:
series = frame.iloc[0]

In [162]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [164]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [165]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [166]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [167]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [168]:
 series3 = frame['d']

In [169]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [170]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [171]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [172]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [173]:
frame

               b         d         e
Utah    0.236260 -1.283408  0.243357
Ohio    0.817610 -1.051128  0.337784
Texas  -1.356321  0.226762 -0.507384
Oregon  0.409939  0.156091  0.711229

In [174]:
np.abs(frame)

               b         d         e
Utah    0.236260  1.283408  0.243357
Ohio    0.817610  1.051128  0.337784
Texas   1.356321  0.226762  0.507384
Oregon  0.409939  0.156091  0.711229

In [175]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.173931
d    1.510170
e    1.218613
dtype: float64

In [176]:
frame.apply(f, axis='columns')

Utah      1.526765
Ohio      1.868739
Texas     1.583084
Oregon    0.555138
dtype: float64

In [177]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [178]:
frame.apply(f)

            b         d         e
min -1.356321 -1.283408 -0.507384
max  0.817610  0.226762  0.711229

In [179]:
format = lambda x: '%.2f' % x

In [180]:
frame.applymap(format)

            b      d      e
Utah     0.24  -1.28   0.24
Ohio     0.82  -1.05   0.34
Texas   -1.36   0.23  -0.51
Oregon   0.41   0.16   0.71

In [181]:
frame['e'].map(format)

Utah       0.24
Ohio       0.34
Texas     -0.51
Oregon     0.71
Name: e, dtype: object

In [182]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [183]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [184]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [185]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [186]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [187]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [188]:
obj = pd.Series([4, 7, -3, 2])

In [189]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [190]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [191]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [192]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [193]:
 frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [194]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [195]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [196]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [197]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [198]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [199]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [200]:
frame.rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [201]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [202]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [203]:
obj.index.is_unique

False

In [204]:
obj['a']

a    0
a    1
dtype: int64

In [205]:
obj['c']

4

In [206]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.287631 -0.676098  0.313945
a  1.279535 -0.993989 -2.043744
b  0.780582  0.588461 -0.604398
b -1.053976 -0.496073  0.252447

In [207]:
 df.loc['b']

          0         1         2
b  0.780582  0.588461 -0.604398
b -1.053976 -0.496073  0.252447

In [208]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [209]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [210]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [211]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [212]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [213]:
df.idxmax()

one    b
two    d
dtype: object

In [214]:
 df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [215]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [216]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [217]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [1]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
    for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
    for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
    for ticker, data in all_data.items()})

NameError: name 'pd' is not defined

In [ ]:
returns = price.pct_change()

In [ ]:
returns.tail()

In [ ]:
returns['MSFT'].corr(returns['IBM'])

In [47]:
returns['MSFT'].cov(returns['IBM'])

8.679687515247442e-05

In [48]:
returns.MSFT.corr(returns.IBM)

0.48689305372314945

In [49]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.373101  0.449943  0.456660
IBM   0.373101  1.000000  0.486893  0.404023
MSFT  0.449943  0.486893  1.000000  0.534783
GOOG  0.456660  0.404023  0.534783  1.000000

In [50]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000271  0.000076  0.000107  0.000116
IBM   0.000076  0.000152  0.000087  0.000077
MSFT  0.000107  0.000087  0.000209  0.000119
GOOG  0.000116  0.000077  0.000119  0.000238

In [41]:
returns.corrwith(returns.IBM)

AAPL    0.373101
IBM     1.000000
MSFT    0.486893
GOOG    0.404023
dtype: float64

In [42]:
returns.corrwith(volume)

AAPL   -0.059619
IBM    -0.155949
MSFT   -0.089507
GOOG   -0.019904
dtype: float64

In [230]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [231]:
uniques = obj.unique()

In [232]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [233]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [234]:
pd.value_counts(obj.values, sort=False)

c    3
b    2
d    1
a    3
dtype: int64

In [235]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [236]:
mask = obj.isin(['b', 'c'])

In [237]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [238]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [239]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [240]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [241]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [242]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})

In [243]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [244]:
result = data.apply(pd.value_counts).fillna(0)

In [245]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [2]:
import pandas as pd
df = pd.read_csv('examples/ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names=['a','b','c','d','message']

In [9]:
pd.read_csv('examples/ex2.csv', names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
parsed=pd.read_csv('examples/csv_mindex.csv',index_col=['key1','key2'])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
list(open('examples/ex3.txt'))

['A B C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382 1.100491']

In [14]:
result = pd.read_table('examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [18]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [20]:
 pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [24]:
pd.options.display.max_rows = 5
result = pd.read_csv('examples/ex6.csv')
result

        one       two     three       four  key
0   0.467976 -0.038649 -0.295344 -1.824726    L
1  -0.358893  1.404453  0.704965 -0.200638    B
..       ...       ...       ...       ...  ...
8  -0.362559  0.598894 -1.843201  0.887292    G
9  -0.096376 -1.012999 -0.657431 -0.573315    0

[10 rows x 5 columns]

In [25]:
pd.read_csv('examples/ex6.csv', nrows=5)

       one       two     three       four  key
0  0.467976 -0.038649 -0.295344 -1.824726    L
1 -0.358893  1.404453  0.704965 -0.200638    B
2 -0.501840  0.659254 -0.421691 -0.057688    G
3  0.204886  1.074134  1.388361 -0.982404    R
4  0.354628 -0.133116  0.283763 -0.837063    Q

In [26]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [27]:
chunker

In [29]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

KeyError: 'key'

In [31]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [51]:
data.to_csv('examples/out.csv')

In [52]:
import sys

In [54]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [55]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [56]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [57]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [58]:
dates = pd.date_range('1/1/2000', periods=7)

In [60]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)

In [61]:
ts.to_csv('examples/tseries.csv')

In [62]:
import csv

In [63]:
f = open('examples/ex7.csv')

In [64]:
reader=csv.reader(f)

In [65]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [66]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [69]:
header,values=lines[0],lines[1:]

In [70]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [71]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [72]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [73]:
import json

In [74]:
result=json.loads(obj)

In [75]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [76]:
asjson = json.dumps(result)

In [77]:
 siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [78]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [79]:
data = pd.read_json('examples/example.json')

In [80]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [81]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [82]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [4]:
import pandas as pd
tables = pd.read_html('examples/fdic_failed_bank_list.html')

ValueError: No tables found

In [3]:
len(tables)

NameError: name 'tables' is not defined

In [5]:
failures = tables[0]
failures.head()
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

NameError: name 'tables' is not defined

In [6]:
from lxml import objectify

In [7]:
path = 'examples/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

FileNotFoundError: [Errno 2] No such file or directory: 'examples/mta_perf/Performance_MNR.xml'

In [8]:
perf = pd.DataFrame(data)
perf.head()

NameError: name 'data' is not defined

In [9]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [10]:
root

In [11]:
root.get('href')

'http://www.google.com'

In [12]:
root.text

'Google'

In [13]:
frame = pd.read_csv('examples/ex1.csv')

FileNotFoundError: File b'examples/ex1.csv' does not exist

In [14]:
frame
frame.to_pickle('examples/frame_pickle')
pd.read_pickle('examples/frame_pickle')

NameError: name 'frame' is not defined

In [16]:
import numpy as np
frame = pd.DataFrame({'a': np.random.randn(100)})

In [17]:
store = pd.HDFStore('mydata.h5')

In [18]:
store['obj1'] = frame

In [19]:
store['obj1_col'] = frame['a']

In [20]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [21]:
store['obj1']

           a
0  -0.448041
1   0.735785
2  -0.019586
3  -0.437883
4   1.139161
5   0.289209
6  -0.923527
7   1.373822
8   0.157015
9   0.132685
10 -1.666629
11  2.162197
12 -0.303104
13  0.188414
14  0.483859
15 -1.070939
16  0.134613
17  0.699620
18 -0.370710
19 -0.239333
20 -0.268188
21 -0.880277
22  1.307364
23 -0.512359
24  0.556366
25 -0.898840
26 -1.102043
27  0.553641
28  0.345071
29  1.419741
..       ...
70 -0.069272
71 -0.199658
72 -0.895368
73 -0.303587
74 -0.768895
75 -1.733299
76 -0.027972
77  1.552996
78  0.770146
79  0.112882
80  0.729635
81  0.688838
82 -0.706224
83 -0.844985
84  0.515664
85 -1.087161
86  0.018129
87 -0.355617
88  1.115998
89 -0.626973
90  1.521562
91 -0.600298
92  0.586064
93 -0.079177
94 -1.746865
95  1.563461
96 -0.368569
97  0.878124
98  1.277997
99 -0.012670

[100 rows x 1 columns]

In [22]:
store.put('obj2', frame, format='table')

In [23]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -1.666629
11  2.162197
12 -0.303104
13  0.188414
14  0.483859
15 -1.070939

In [24]:
store.close()

In [25]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [26]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.448041
1  0.735785
2 -0.019586
3 -0.437883
4  1.139161

In [27]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx,'Sheet1')

FileNotFoundError: [Errno 2] No such file or directory: 'examples/ex1.xlsx'

In [28]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

FileNotFoundError: [Errno 2] No such file or directory: 'examples/ex1.xlsx'

In [30]:
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()
frame.to_excel('examples/ex2.xlsx')

In [31]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [32]:
data = resp.json()

In [33]:
data[0]['title']

'Using .loc.__setitem__ with integer slices does not raise'

In [34]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])

In [35]:
issues

,number,title,labels,state
0,26412,Using .loc.__setitem__ with integer slices doe...,[],open
1,26411,"Grouping, then resampling empty DataFrame lead...",[],open
2,26410,"API: getting the ""densified"" values of a Categ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
3,26409,DEPR: deprecate get_values,[],open
4,26408,BUG: MultiIndex not dropping nan level and inv...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
5,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
6,26406,BUG: to_numpy on categorical data with tz awar...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
8,26404,Fix type annotations in pandas.core.indexes.da...,[],open
9,26403,DEPR: Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
10,26400,ENH: Support multiple opening hours intervals ...,[],open
11,26399,ENH: Support nested renaming / selection,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
12,26398,Fix type annotations in pandas.core.resample,"[{'id': 74975453, 'node_id': 'MDU6TGFiZWw3NDk3...",open
13,26397,DataFrame.describe excludes top and freq for e...,[],open
14,26395,different type conversion results in assignmen...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
15,26394,BUG: to_numeric does not validate the errors k...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
16,26393,Holiday based on the lunar calendar?,[],open
17,26392,[TEST] Add two more parameters to the test_dti...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
18,26391,[PERF] Get rid of MultiIndex conversion in Int...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
19,26390,BUG: assigning Series.array / PandasArray to c...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
20,26389,Converting json to csv,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
21,26388,read_parquet S3 dir support,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
22,26385,GroupBy nth ignores observed keyword for Categ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
23,26383,Prefixed batch script commands with call,[],open
24,26381,BUG: error calculating BusinessHourMixin.apply...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,26380,ENH: Implementing NEP 18's __array_function__,[],open
26,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open

In [57]:
import sqlite3

In [58]:
query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER );"""

In [59]:
con = sqlite3.connect('mydata.sqllite')

In [60]:
con.execute(query)

OperationalError: table test already exists

In [61]:
con.commit()

In [62]:
data = [('Atlanta', 'Georgia', 1.25, 6),
     ('Tallahassee', 'Florida', 2.6, 3),
     ('Sacramento', 'California', 1.7, 5)]

In [63]:
stmt =  "INSERT INTO test VALUES(?, ?, ?, ?)"

In [64]:
con.executemany(stmt, data)

In [65]:
con.commit()

In [66]:
cursor = con.execute('select * from test')

In [67]:
rows = cursor.fetchall()

In [68]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [69]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [70]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [71]:
import sqlalchemy as sqla

In [77]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [78]:
pd.read_sql('select * from test', db)

OperationalError: (sqlite3.OperationalError) no such table: test [SQL: 'select * from test'] (Background on this error at: http://sqlalche.me/e/e3q8)